In [2]:
!pip install pandas

Requirement already satisfied: pandas in /home/coder/miniconda3/lib/python3.11/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /home/coder/miniconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pandas as pd
import numpy as np

#### Series

In [5]:
labels = ['a','b','c','d']
list1 = [10, 20, 30, 40]
arr = np.array(list1)
dict1 = {'a':10, 'b':20, 'c':30, 'd':40}

#### List as a source of data

In [7]:
series = pd.Series(list1)
type(series)

pandas.core.series.Series

In [8]:
series

0    10
1    20
2    30
3    40
dtype: int64

In [9]:
series[2]

30

In [10]:
pd.Series(data=list1)

0    10
1    20
2    30
3    40
dtype: int64

In [20]:
series = pd.Series(index=labels, data=list1) # Custom labels
series

a    10
b    20
c    30
d    40
dtype: int64

In [14]:
series['c']

30

#### Numpy array as a source of data

In [15]:
arr

array([10, 20, 30, 40])

In [16]:
series = pd.Series(arr)
series

0    10
1    20
2    30
3    40
dtype: int64

In [17]:
series = pd.Series(arr, index=labels)
series

a    10
b    20
c    30
d    40
dtype: int64

In [18]:
series = pd.Series(arr, index=labels, dtype='int32')
series

a    10
b    20
c    30
d    40
dtype: int32

In [21]:
series = pd.Series(arr, index=labels, dtype=np.int32)
series

a    10
b    20
c    30
d    40
dtype: int32

#### Dictionary as a source of data

In [24]:
series = pd.Series(dict1)
series

a    10
b    20
c    30
d    40
dtype: int64

In [25]:
series['d']

40

In [26]:
series = pd.Series(index=['France','Canada','USA','Japan'], data=[60, 40, 345, 124])
series

France     60
Canada     40
USA       345
Japan     124
dtype: int64

In [27]:
series['USA']

345

In [30]:
groceries = pd.Series({'bananas':6, 'oranges':3, 'apples':5})
groceries

bananas    6
oranges    3
apples     5
dtype: int64

In [31]:
groceries['apples']

5

In [32]:
groceries2 = pd.Series([2,4,5,3],['bananas', 'apples', 'oranges', 'pineapple'])
groceries2

bananas      2
apples       4
oranges      5
pineapple    3
dtype: int64

In [39]:
groceries2.sort_values()

bananas      2
pineapple    3
apples       4
oranges      5
dtype: int64

In [40]:
groceries2.sort_index()

apples       4
bananas      2
oranges      5
pineapple    3
dtype: int64

In [33]:
all_groceries = groceries + groceries2
all_groceries

apples       9.0
bananas      8.0
oranges      8.0
pineapple    NaN
dtype: float64

In [34]:
groceries3 = all_groceries.add(2)
groceries3

apples       11.0
bananas      10.0
oranges      10.0
pineapple     NaN
dtype: float64

In [35]:
groceries3 = all_groceries.subtract(3)
groceries3

apples       6.0
bananas      5.0
oranges      5.0
pineapple    NaN
dtype: float64

In [36]:
all_groceries.max()

9.0

In [37]:
all_groceries.sum()

25.0

In [38]:
all_groceries

apples       9.0
bananas      8.0
oranges      8.0
pineapple    NaN
dtype: float64

In [41]:
all_groceries.isnull()

apples       False
bananas      False
oranges      False
pineapple     True
dtype: bool

In [42]:
all_groceries.notnull()

apples        True
bananas       True
oranges       True
pineapple    False
dtype: bool

In [43]:
all_groceries

apples       9.0
bananas      8.0
oranges      8.0
pineapple    NaN
dtype: float64

In [44]:
all_groceries.fillna(5)

apples       9.0
bananas      8.0
oranges      8.0
pineapple    5.0
dtype: float64

In [46]:
all_groceries.replace(8, 10)

apples        9.0
bananas      10.0
oranges      10.0
pineapple     NaN
dtype: float64

In [47]:
all_groceries

apples       9.0
bananas      8.0
oranges      8.0
pineapple    NaN
dtype: float64

In [48]:
all_groceries.to_list() # values will be there in the list

[9.0, 8.0, 8.0, nan]

In [49]:
all_groceries.to_dict() # labels will becoms keys and data will be the value foe corresponding keys

{'apples': 9.0, 'bananas': 8.0, 'oranges': 8.0, 'pineapple': nan}

In [50]:
all_groceries.to_frame() # DataFrame

             0
apples     9.0
bananas    8.0
oranges    8.0
pineapple  NaN

In [51]:
all_groceries.to_frame(name = 'count') # DataFrame with column name

           count
apples       9.0
bananas      8.0
oranges      8.0
pineapple    NaN

In [52]:
all_groceries.to_excel('groceries.xlsx') # Save as Excel document

#### Working wih DataFrames

In [56]:
np.random.seed(42)
df = pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [57]:
df = pd.DataFrame(np.random.randn(5,4), index=['A','B','C','D','E'])
df

          0         1         2         3
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
C -0.600639 -0.291694 -0.601707  1.852278
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

In [58]:
df = pd.DataFrame(np.random.randn(5,4), index=['A','B','C','D','E'], columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

#### Extract  a column as a Series

In [62]:
col_name = 'X'
df[col_name]

A    0.171368
B   -0.719844
C   -1.763040
D    0.611676
E   -0.309212
Name: X, dtype: float64

In [64]:
# SQL style
# type(df.W)
df.W

A    0.738467
B   -1.478522
C    0.343618
D   -0.676922
E   -0.839218
Name: W, dtype: float64

In [65]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

#### Add a new column

In [69]:
df['K'] = 1
df['K'] = df['W']
df['K'] = df['W'] + df['X']
df

          W         X         Y         Z         K
A  0.738467  0.171368 -0.115648 -0.301104  0.909835
B -1.478522 -0.719844 -0.460639  1.057122 -2.198366
C  0.343618 -1.763040  0.324084 -0.385082 -1.419422
D -0.676922  0.611676  1.031000  0.931280 -0.065246
E -0.839218 -0.309212  0.331263  0.975545 -1.148430

#### Drop a column

In [75]:
df.drop('K', axis=1) # axis=1 implies column

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [76]:
df

          W         X         Y         Z         K
A  0.738467  0.171368 -0.115648 -0.301104  0.909835
B -1.478522 -0.719844 -0.460639  1.057122 -2.198366
C  0.343618 -1.763040  0.324084 -0.385082 -1.419422
D -0.676922  0.611676  1.031000  0.931280 -0.065246
E -0.839218 -0.309212  0.331263  0.975545 -1.148430

In [77]:
# changes are not in-place bt default, any modification will create and return a new DataFrame
# when inplace=True is specified, it will result in modifying the DataFrame and will not return a new DataFrame
df.drop('K', inplace=True, axis=1) # axis=1 implies column

In [78]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

#### Get a Row as a Series

In [80]:
type(df.loc['A'])

pandas.core.series.Series

In [81]:
df.loc['A'] # Get by row name

W    0.738467
X    0.171368
Y   -0.115648
Z   -0.301104
Name: A, dtype: float64

In [83]:
df.iloc[0] # Get by row index

W    0.738467
X    0.171368
Y   -0.115648
Z   -0.301104
Name: A, dtype: float64

In [84]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [86]:
df.loc['D']['X'] # Get a single value

0.6116762888408679

In [87]:
df.loc['D','X']

0.6116762888408679

In [89]:
df.loc[['A']] # Get a Row as DataFrame having one row and all columns

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104

In [90]:
df.loc[['A'],['X','Y']] # Get a Row as DataFrame having one row and multiple columns

          X         Y
A  0.171368 -0.115648

In [91]:
df.loc[['A','C'],['X','Y']] # Get multiple Rows and columns

          X         Y
A  0.171368 -0.115648
C -1.763040  0.324084

In [92]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [93]:
df[df > 0]

          W         X         Y         Z
A  0.738467  0.171368       NaN       NaN
B       NaN       NaN       NaN  1.057122
C  0.343618       NaN  0.324084       NaN
D       NaN  0.611676  1.031000  0.931280
E       NaN       NaN  0.331263  0.975545

In [94]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [95]:
df[df['W'] > 0] # Get rows having 'W' value as greater than 0

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
C  0.343618 -1.763040  0.324084 -0.385082

In [96]:
df[df['W'] > 0][['W','X']] # Get rows having 'W' value as greater than 0 and specific columns only

          W         X
A  0.738467  0.171368
C  0.343618 -1.763040

In [97]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [101]:
df[ (df['W'] > 0) & (df['Y'] > 0) ] # Get rows having 'W' AND 'Y' values as greater than 0

          W        X         Y         Z
C  0.343618 -1.76304  0.324084 -0.385082

#### Missing Data

In [102]:
df = pd.DataFrame(
    {
     'A': [1, 2, ''],
     'B': [4, '', ''],
     'C': [7, 8, 9]
    })

df

   A  B  C
0  1  4  7
1  2     8
2        9

In [107]:
df = pd.DataFrame(
    {
     'A': [1, 2, np.nan],
     'B': [4, np.nan, np.nan],
     'C': [7, 8, 9]
    })

df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [104]:
df.dropna() # drop rows which have atleast one missing data

     A    B  C
0  1.0  4.0  7

In [105]:
df.dropna(axis=1) # drop columns which have atleast one missing data

   C
0  7
1  8
2  9

In [109]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [110]:
df.dropna(thresh=2) # retain rows having atleast 2 non missing values

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [111]:
df.dropna(thresh=2, axis=1) # retain cols having atleast 2 non missing values

     A  C
0  1.0  7
1  2.0  8
2  NaN  9

In [112]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [113]:
df.fillna(0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  8
2  0.0  0.0  9

In [114]:
df.fillna(df.mean())

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  8
2  1.5  4.0  9

In [116]:
# Retrieve column 'A' and fill the missing values by the mean of that column 
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [133]:
df = pd.DataFrame({
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Sam', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
})

df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT      Sam    124
4      FB     Carl    243
5      FB    Sarah    350

In [134]:
df.groupby('Company').sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT         AmySam    464

In [124]:
df.groupby('Company').mean('Sale')

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [142]:
df.groupby('Person').sum().loc[['Sam'],['Sales']] # Total sale value of 'Sam'

        Sales
Person
Sam       324

In [126]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [127]:
df.groupby('Company').min('Sale')

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [128]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [129]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [146]:
df.groupby('Company')['Sales'].std() # standard deviation of Sales, Company wise

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

#### Reading Data

In [147]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [150]:
df.to_csv('example2.csv', index=False)
print('Saved as CSV file')

Saved as CSV file

In [151]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/coder/miniconda3/lib/python3.11/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /home/coder/miniconda3/lib/python3.11/site-packages (from openpyxl) (2.0.0)

In [152]:
df.to_excel('example.xlsx', sheet_name='My-data', index=False)
print('Saved as Excel file')

Saved as Excel file

In [153]:
df = pd.read_excel('example.xlsx')
df

    a   b   c    d
0   0   1   2  333
1   4   5   6  777
2   8   9  10  111
3  12  13  14  555

In [154]:
# Load remote table as a DataFrame
url = 'https://www.w3schools.com/html/html_tables.asp'
df_array = pd.read_html(url)
df = df_array[0]
df

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [155]:
# Load remote table as a DataFrame
url = 'https://www.fdic.gov/bank-failures/failed-bank-list'
df_array = pd.read_html(url)
df = df_array[0]
df

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [171]:
df = pd.read_csv('download-data.csv', encoding='windows-1252')
df

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,Pulaski Savings Bank,Chicago,IL,28611,Millennium Bank,17-Jan-25,10548
1,First National Bank of Lindsay,Lindsay,OK,4134,First Bank & Trust Co.,18-Oct-24,10547
2,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association",26-Apr-24,10546
3,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,3-Nov-23,10545
4,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.",28-Jul-23,10544
...,...,...,...,...,...,...,...
566,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
567,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
568,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
569,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
570,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [160]:
df.head(10)

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,Pulaski Savings Bank,Chicago,IL,28611,Millennium Bank,17-Jan-25,10548
1,First National Bank of Lindsay,Lindsay,OK,4134,First Bank & Trust Co.,18-Oct-24,10547
2,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association",26-Apr-24,10546
3,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,3-Nov-23,10545
4,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.",28-Jul-23,10544
5,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.",1-May-23,10543
6,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.",12-Mar-23,10540
7,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,10-Mar-23,10539
8,Almena State Bank,Almena,KS,15426,Equity Bank,23-Oct-20,10538
9,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb",16-Oct-20,10537

In [161]:
df.tail()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
566,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
567,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
568,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
569,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
570,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [162]:
df.tail(10)

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
561,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,7-Feb-02,4653
562,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,1-Feb-02,4652
563,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,18-Jan-02,4651
564,"Hamilton Bank, NA",Miami,FL,24382,Israel Discount Bank of New York,11-Jan-02,4650
565,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,7-Sep-01,4649
566,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
567,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
568,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
569,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
570,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [163]:
df.count()

Bank Name                 571
City                      571
State                     571
Cert                      571
Acquiring Institution     571
Closing Date              571
Fund                      571
dtype: int64

In [172]:
df.columns

Index(['Bank Name', 'City', 'State', 'Cert', 'Acquiring Institution',
       'Closing Date', 'Fund'],
      dtype='object')

In [182]:
df[df['State'] == 'AR']['Bank Name'].count()

4

In [183]:
df[df['State'] == 'IL']['Bank Name'].head(4)

0                    Pulaski Savings Bank
16    Washington Federal Bank for Savings
18                    Fayette County Bank
22          Seaway Bank and Trust Company
Name: Bank Name, dtype: object

In [180]:
pd.set_option('display.max_rows',100)
df[df['State'] == 'IL']['Bank Name']

0                                   Pulaski Savings Bank
16                   Washington Federal Bank for Savings
18                                   Fayette County Bank
22                         Seaway Bank and Trust Company
32                                        Edgebrook Bank
35                               Highland Community Bank
39                 The National Republic Bank of Chicago
41                                 GreenChoice Bank, fsb
45                                           Valley Bank
48                                     AztecAmerica Bank
54                                  DuPage National Bank
76                                         Covenant Bank
81                          Citizens First National Bank
87                                     First United Bank
90                                 Waukegan Savings Bank
92     Second Federal Savings and Loan Association of...
103                     Farmers' and Traders' State Bank
115                                         Premier Bank
117                                        New City Bank
122                      Charter National Bank and Trust
137                                    All American Bank
142                                         Country Bank
154                                    First Choice Bank
160                                    Bank of Shorewood
173                           First Chicago Bank & Trust
195              Western Springs National Bank and Trust
196                                 The Bank of Commerce
199                                Valley Community Bank
208                         Community First Bank Chicago
242                         First Suburban National Bank
265                                            ShoreBank
269                         Palos Bank and Trust Company
270                                      Ravenswood Bank
299                        Arcola Homestead Savings Bank
307                       Midwest Bank and Trust Company
322                                       Wheatland Bank
323                       Peotone Bank and Trust Company
324                            Lincoln Park Savings Bank
325                                     New Century Bank
326           Citizens Bank and Trust Company of Chicago
327                                        Broadway Bank
328                    Amcore Bank, National Association
355                                     Bank of Illinois
360                       George Washington Savings Bank
377                          Town Community Bank & Trust
381                            Independent Bankers' Bank
390                                       Benchmark Bank
407                                   Park National Bank
411                             Community Bank of Lemont
413                                    First DuPage Bank
429                                     Corus Bank, N.A.
431                              Platinum Community Bank
433                                               InBank
450                                          Mutual Bank
467                                        Founders Bank
469                      First National Bank of Danville
470                             The Elizabeth State Bank
471                                      Rock River Bank
472                       First State Bank of Winchester
473                                     John Warner Bank
482                                  Bank of Lincolnwood
483                               Citizens National Bank
484                               Strategic Capital Bank
504                              Heritage Community Bank
507                           Corn Belt Bank & Trust Co.
518                            National Bank of Commerce
529                                        Meridian Bank
557                       Universal Federal Savings Bank
566                                   Superior Bank, FSB
569                    National State Bank of Metropolis
Name: Bank Name, dtype: object